In [2]:
import pandas as pd

a = [11, 22, 33, 44]
b = [91, 92, 93, 94]
name = ["C1", "C2", "C3", "C4"]
df1 = pd.DataFrame([a, b])
df1.columns = name
df1

   C1  C2  C3  C4
0  11  22  33  44
1  91  92  93  94

In [3]:
a = [11, "a", "a1"]
b = [91, "b", "b1"]
c = [11, "c", "c1"]
name = ["C1", "D1", "D2"]
df2 = pd.DataFrame([a, b, c])
df2.columns = name
df2

   C1 D1  D2
0  11  a  a1
1  91  b  b1
2  11  c  c1

In [5]:
pd.concat([df1, df2], axis=0)

   C1    C2    C3    C4   D1   D2
0  11  22.0  33.0  44.0  NaN  NaN
1  91  92.0  93.0  94.0  NaN  NaN
0  11   NaN   NaN   NaN    a   a1
1  91   NaN   NaN   NaN    b   b1
2  11   NaN   NaN   NaN    c   c1

In [7]:
df1.merge(df2)

   C1  C2  C3  C4 D1  D2
0  11  22  33  44  a  a1
1  11  22  33  44  c  c1
2  91  92  93  94  b  b1